Enums/упВидыСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыСобытийМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВъездВЗону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыездИзЗоны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеДатчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененияЗначенияДатчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеОтМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеAndroidКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланируемоеОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадержкаВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвижениеБезРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеВнешнейСистемыМониторинга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыСобытийМониторинга/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	упВидыСобытийМониторинга.Ссылка
	|ИЗ
	|	Перечисление.упВидыСобытийМониторинга КАК упВидыСобытийМониторинга
	|ГДЕ
	|	НЕ упВидыСобытийМониторинга.Ссылка В (ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.СобытиеВнешнейСистемыМониторинга), ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ОпозданиеВТочкеМаршрута), ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ПланируемоеОпозданиеВТочкеМаршрута))
	|
	|УПОРЯДОЧИТЬ ПО
	|	упВидыСобытийМониторинга.Порядок";
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
